<?php

/**
 * Properties Russian Lexicon Entries for MiniShop3
 *
 * @package MiniShop3
 * @subpackage lexicon
 */

$_lang['ms3_prop_limit'] = 'Лимит выборки результатов';
$_lang['ms3_prop_offset'] = 'Пропуск результатов с начала выборки';
$_lang['ms3_prop_depth'] = 'Глубина поиска товаров от каждого родителя.';
$_lang['ms3_prop_sortby'] = 'Сортировка выборки. Для сортировки по полям товара нужно добавить префикс "Data.", например: "&sortby=`Data.price`"';
$_lang['ms3_prop_sortdir'] = 'Направление сортировки';
$_lang['ms3_prop_tpl'] = 'Чанк оформления для каждого результата';
$_lang['ms3_prop_to_placeholder'] = 'Если не пусто, сниппет сохранит все данные в плейсхолдер с этим именем, вместо вывода не экран.';
$_lang['ms3_prop_to_separate_placeholders'] = 'Если вы укажете слово в этом параметре, то ВСЕ результаты будут выставлены в разные плейсхолдеры, начинающиеся с этого слова и заканчивающиеся порядковым номером строки, от нуля. Например, указав в параметре "myPl", вы получите плейсхолдеры [[+myPl0]], [[+myPl1]] и т.д.';
$_lang['ms3_prop_show_log'] = 'Показывать дополнительную информацию о работе сниппета. Только для авторизованных в контексте "mgr".';
$_lang['ms3_prop_parents'] = 'Список категорий, через запятую, для поиска результатов. По умолчанию выборка ограничена текущим родителем. Если поставить 0 - выборка не ограничивается.';
$_lang['ms3_prop_resources'] = 'Список товаров, через запятую, для вывода в результатах. Если id товара начинается с минуса, этот товар исключается из выборки.';
$_lang['ms3_prop_fast_mode'] = 'Если включено - в чанк результата будут подставлены только значения из БД. Все необработанные теги MODX, такие как фильтры, вызов сниппетов и другие - будут вырезаны.';
$_lang['ms3_prop_where'] = 'Строка, закодированная в JSON, с дополнительными условиями выборки.';
$_lang['ms3_prop_include_content'] = 'Выбирать поле "content" у товаров.';
$_lang['ms3_prop_include_tvs'] = 'Список ТВ параметров для выборки, через запятую. Например: "action,time" дадут плейсхолдеры [[+action]] и [[+time]].';
$_lang['ms3_prop_include_thumbs'] = 'Список размеров превьюшек для выборки, через запятую. Например: "small,medium" дадут плейслолдеры [[+small]] и [[+medium]]. Картинки должны быть заранее сгенерированы в галерее товара.';
$_lang['ms3_prop_include_vendor_fields'] = 'Список полей таблицы производителя для выборки, через запятую. Например: "name,logo". По умолчанию выбираются все поля через *.';
$_lang['ms3_prop_link'] = 'Id связи товаров, который присваивается автоматически при создании новой связи в настройках.';
$_lang['ms3_prop_master'] = 'Id главного товара. Если указаны и "master" и "slave" - выборка пройдёт по master.';
$_lang['ms3_prop_slave'] = 'Id подчиненного товара. Если указан "master" - эта опция игнорируется.';
$_lang['ms3_prop_class'] = 'Имя класса для выборки. По умолчанию, "msProduct".';
$_lang['ms3_prop_tv_prefix'] = 'Префикс для ТВ плейсхолдеров, например "tv.". По умолчанию параметр пуст.';
$_lang['ms3_prop_output_separator'] = 'Необязательная строка для разделения результатов работы.';
$_lang['ms3_prop_return_ids'] = 'Возвращать строку с id товаров, вместо оформленных чанков.';
$_lang['ms3_prop_return'] = 'Способ вывода результатов';

$_lang['ms3_prop_show_unpublished'] = 'Показывать неопубликованные товары.';
$_lang['ms3_prop_show_deleted'] = 'Показывать удалённые товары.';
$_lang['ms3_prop_show_hidden'] = 'Показывать товары, скрытые в меню.';
$_lang['ms3_prop_show_zero_price'] = 'Показывать товары с нулевой ценой.';

$_lang['ms3_prop_tpl_row'] = 'Чанк оформления одного элемента выборки.';
$_lang['ms3_prop_tpl_single'] = 'Чанк оформления единственного результата выборки.';
$_lang['ms3_prop_tpl_outer'] = 'Обёртка для вывода результатов работы сниппета.';
$_lang['ms3_prop_tpl_empty'] = 'Чанк, который выводится при отсутствии результатов.';
$_lang['ms3_prop_tpl_success'] = 'Чанк с сообщением об успешной работе сниппета.';
$_lang['ms3_prop_tpl_payments_outer'] = 'Чанк для оформления блока возможных методов оплаты.';
$_lang['ms3_prop_tpl_payments_row'] = 'Чанк для оформления одного метода оплаты.';
$_lang['ms3_prop_tpl_deliveries_outer'] = 'Чанк для оформления блока возможных способов доставки.';
$_lang['ms3_prop_tpl_deliveries_row'] = 'Чанк для оформления одного способа доставки.';

$_lang['ms3_prop_options'] = 'Список опций для вывода, через запятую.';
$_lang['ms3_prop_product'] = 'Идентификатор товара. Если не указан, используется id текущего документа.';
$_lang['ms3_prop_option_selected'] = 'Имя активной опции, чтобы поставить аттрибут "selected"';
$_lang['ms3_prop_option_name'] = 'Имя опции для вывода.';
$_lang['ms3_prop_filetype'] = 'Тип файлов для выборки. Можно использовать "image" для указания картинок и расширения для остальных файлов. Например: "image,pdf,xls,doc".';
$_lang['ms3_prop_option_filters'] = 'Фильтры по опциям товаров. Передаются JSON строкой, например, {"optionkey:>":10}';
$_lang['ms3_prop_sortby_options'] = 'Указывает по каким опциям и как сортировать среди перечисленного в &sortby. Передаются строкой, например, "optionkey:integer,optionkey2:datetime"';
$_lang['ms3_prop_sort_groups'] = 'Указывает порядок сортировки групп опций. Принимает как id-шники, так и текстовые названия групп. Передаются строкой, например: "22,23,24" или "Размеры,Электроника,Разное".';
$_lang['ms3_prop_sort_options'] = 'Указывает порядок сортировки опций. Передаются строкой, например: "size,color".';
$_lang['ms3_prop_sort_option_values'] = 'Указывает порядок сортировки значений опций. Передаются строкой, например: "size:SORT_DESC:SORT_NUMERIC:100,color:SORT_ASC:SORT_STRING"';
$_lang['ms3_prop_values_separator'] = 'Разделитель для значений множественных опций';
$_lang['ms3_prop_ignore_groups'] = 'Группы, опции которых не нужно выводить в списке, через запятую.';
$_lang['ms3_prop_ignore_options'] = 'Опции, которые не нужно выводить в списке, через запятую.';
$_lang['ms3_prop_only_options'] = 'Выводить только этот список опций, указанный через запятую';
$_lang['ms3_prop_hide_empty'] = 'Не показывать опции с пустыми значениями.';
$_lang['ms3_prop_groups'] = 'Выводить опции только указанных групп (название или идентификатор категории через запятую, "0" означает без групп)';
$_lang['ms3_prop_tpl_value'] = 'Шаблон одного значения (только для множественных опций)';

$_lang['ms3_prop_user_fields'] = 'Ассоциативный массив соответствия полей заказа полям профиля пользователя (modUserProfile) в формате "поле заказа" => "поле профиля".';
$_lang['ms3_prop_customer_fields'] = 'Ассоциативный массив соответствия полей заказа полям клиента (msCustomer) в формате "поле заказа" => "поле клиента".';
$_lang['ms3_prop_wrap_if_empty'] = 'Включает вывод чанка-обертки (tplWrapper) даже если результатов нет.';
$_lang['ms3_prop_include_delivery_fields'] = 'Список полей таблицы msDelivery для выборки, через запятую. Например: "name,price,free_delivery_amount". По умолчанию выбираются все поля через *.';
$_lang['ms3_prop_include_payment_fields'] = 'Список полей таблицы msPayment для выборки, через запятую. Например: "name,description,price,logo". По умолчанию выбираются все поля через *.';
